1.collection of data -- salary data
2.preprocesing
3.analysis
4.training
5.testing
6.Deployment

In [1]:
import numpy as np
import pandas as pd

In [6]:
dataset=pd.read_csv(r"C:\Users\PRAKASH KATIKANENI\Downloads\salary_data.csv")

In [7]:
dataset.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [8]:
dataset.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [ ]:
import matlotlib.pylot as plt
plt.scatter(dataset[''])